{
    "name": "tgi",
    "backend": {
        "name": "py-txi",
        "version": "0.9.0",
        "_target_": "optimum_benchmark.backends.py_txi.backend.PyTXIBackend",
        "task": "text-generation",
        "library": "transformers",
        "model_type": "llama",
        "model": "TinyLlama/TinyLlama-1.1B-Chat-v1.0",
        "processor": "TinyLlama/TinyLlama-1.1B-Chat-v1.0",
        "device": "cuda",
        "device_ids": "0",
        "seed": 42,
        "inter_op_num_threads": null,
        "intra_op_num_threads": null,
        "model_kwargs": {},
        "processor_kwargs": {},
        "hub_kwargs": {},
        "no_weights": true,
        "image": null,
        "shm_size": "1g",
        "devices": null,
        "gpus": "0",
        "ports": {
            "80/tcp": [
                "127.0.0.1",
                0
            ]
        },
        "volumes": {
            "/home/ubuntu/.cache/huggingface/hub": {
                "bind": "/data",
                "mode": "rw"
            }
        },
        "environment": [
            "HUGGING_FACE_HUB_TOKEN"
        ],
        "dtype": null,
        "max_concurrent_requests": 128,
        "sharded": null,
        "quantize": null,
        "num_shard": null,
        "speculate": null,
        "cuda_graphs": null,
        "disable_custom_kernels": null,
        "trust_remote_code": false,
        "pooling": null
    },
    "scenario": {
        "name": "inference",
        "_target_": "optimum_benchmark.scenarios.inference.scenario.InferenceScenario",
        "iterations": 10,
        "duration": 10,
        "warmup_runs": 10,
        "input_shapes": {
            "batch_size": 1,
            "num_choices": 2,
            "sequence_length": 256
        },
        "new_tokens": null,
        "memory": true,
        "latency": true,
        "energy": true,
        "forward_kwargs": {},
        "generate_kwargs": {
            "max_new_tokens": 256,
            "min_new_tokens": 256
        },
        "call_kwargs": {}
    },
    "launcher": {
        "name": "process",
        "_target_": "optimum_benchmark.launchers.process.launcher.ProcessLauncher",
        "device_isolation": true,
        "device_isolation_action": "warn",
        "numactl": false,
        "numactl_kwargs": {},
        "start_method": "spawn"
    },
    "environment": {
        "cpu": " Intel(R) Xeon(R) Platinum 8358 CPU @ 2.60GHz",
        "cpu_count": 30,
        "cpu_ram_mb": 238540.017664,
        "system": "Linux",
        "machine": "x86_64",
        "platform": "Linux-6.2.0-37-generic-x86_64-with-glibc2.35",
        "processor": "x86_64",
        "python_version": "3.10.12",
        "gpu": [
            "NVIDIA A10"
        ],
        "gpu_count": 1,
        "gpu_vram_mb": 24146608128,
        "optimum_benchmark_version": "0.3.1",
        "optimum_benchmark_commit": null,
        "transformers_version": "4.42.4",
        "transformers_commit": null,
        "accelerate_version": "0.32.1",
        "accelerate_commit": null,
        "diffusers_version": null,
        "diffusers_commit": null,
        "optimum_version": null,
        "optimum_commit": null,
        "timm_version": null,
        "timm_commit": null,
        "peft_version": null,
        "peft_commit": null
    }
}